STUFF = {'pri': [
                 ['Меч Ученика', 'grade0', None], ['Короткий меч', 'grade0', None], ['Длинный меч', 'grade0', None],
                 ['Меч Вдовы', 'grade0', None], ['Меч Рыцаря', 'grade0', None],
                 ['Короткое копье', 'grade0', None], ['Длинное копье', 'grade0', None],
                 ['Эльфийское копье', 'grade1', None], ['Эльфийский меч', 'grade1', None], ['Рапира', 'grade1', None],
                 ['Кирка шахтера', 'grade2', None], ['Кузнечный молот', 'grade3', None],
                 ['Молот гномов', 'grade3', None], ['Костолом', 'grade4', None],
                 ['Меч берсеркера', 'grade2', None], ['Экскалибур', 'grade3', None], ['Нарсил', 'grade4', None],
                 ['Хранитель', 'grade2', None], ['Трезубец', 'grade3', None], ['Алебарда', 'grade4', None]
                ],
         'sec': [
                 ['Кухонный нож', 'grade0', None], ['Боевой нож', 'grade0', None],
                 ['Деревянный щит ', 'grade0', None], ['Щит скелета', 'grade0', None],
                 ['Бронзовый щит', 'grade0', None], ['Серебряный щит', 'grade0', None],
                 ['Мифриловый щит', 'grade1', None],
                 ['Клещи', 'grade3', None],
                 ['Кинжал охотника', 'grade2', None], ['Кинжал демона', 'grade3', None], ['Кинжал триумфа', 'grade4', None],
                 ['Щит хранителя', 'grade2', None], ['Щит паладина', 'grade3', None], ['Щит крестоносца', 'grade4', None],
                 ['Кинжал', 'grade1', None]
                ],
         'head': [
                  ['Шляпа', 'grade0', None], ['Стальной шлем', 'grade0', None], ['Серебряный шлем', 'grade0', None],
                  ['Мифриловый шлем', 'grade1', None],
                  ['Шапка охотника', 'grade2', None], ['Шапка демона', 'grade3', None], ['Шапка триумфа', 'grade4', None],
                  ['Шлем хранителя', 'grade2', None], ['Шлем паладина', 'grade3', None], ['Шлем крестоносца', 'grade4', None]
                 ],
         'arms': [
                  ['Кожаные перчатки', 'grade0', None], ['Стальные перчатки', 'grade0', None],
                  ['Серебряные перчатки', 'grade0', None],
                  ['Мифриловые перчатки', 'grade1', None],
                  ['Рукавицы', 'grade3', None],
                  ['Браслеты охотника', 'grade2', None], ['Браслеты демона', 'grade3', None],
                  ['Браслеты триумфа', 'grade4', None],
                  ['Перчатки хранителя', 'grade2', None], ['Перчатки паладина', 'grade3', None],
                  ['Перчатки крестоносца', 'grade4', None],
                  ['Браслеты', 'grade0', None],
                 ],
         'armor': [
                   ['Плотная куртка', 'grade0', None], ['Кожаный доспех', 'grade0', None],
                   ['Стальная броня', 'grade0', None],
                   ['Мифриловая броня', 'grade1', None],
                   ['Кузнечная роба', 'grade3', None],
                   ['Куртка охотника', 'grade2', None], ['Куртка демона', 'grade3', None],
                   ['Куртка триумфа', 'grade4', None],
                   ['Броня хранителя', 'grade2', None], ['Броня паладина', 'grade3', None],
                   ['Броня крестоносца', 'grade4', None]
                  ],
         'legs': [
                  ['Сандалии', 'grade0', None], ['Кожаные сапоги', 'grade0', None], ['Стальные сапоги', 'grade0', None],
                  ['Серебряные сапоги', 'grade0', None],
                  ['Мифриловые сапоги', 'grade1', None],
                  ['Ботинки охотника', 'grade2', None], ['Ботинки демона', 'grade3', None],
                  ['Ботинки триумфа', 'grade4', None],
                  ['Сапоги хранителя', 'grade2', None], ['Сапоги паладина', 'grade3', None],
                  ['Сапоги крестоносца', 'grade4', None]
                 ],
         'bottle': [
                    ['Фляга', 'color_off', '+1 🔋'], ['Бутылка рома', 'color_off', '+2 🔋'],
                    ['Бутылка', 'color_off', '+1 🔋']
                   ]
         }

EQUIP_PARTS = ['pri', 'sec', 'head', 'arms', 'armor', 'legs', 'bottle']

COLORS = {'color_off': None,
          'grade0': None,
          'grade1': 'e0ffff',
          'grade2': 'f5cbcc',
          'grade3': 'fbe5cc',
          'grade4': 'd5ebd5'
          }

MSG_UNDER_CONSTRUCTION = 'Страница находится в разработке'
